import Mindustry from './images/Attack.png';

export const cards = [
  {
    mode: 'Attack',
    ipPort: 'darkdustry.ml:0000',
    description:
      'Постройте вашу базу путём создания большого количества продукции и постройки хорошей инфраструктуры, затем создайте армию, чтобы разрушить вражескую базу, которая может посылать к вам врагов',
    image: Mindustry,
  },
  {
    mode: 'Survival',
    ipPort: 'darkdustry.ml:0000',
    description:
      'Стройте и развивайте вашу базу, чтобы держаться как можно дольше в то время, как на вас будут нападать бесконечные волны врагов',
    image: Mindustry,
  },
  {
    mode: 'Sandbox',
    ipPort: 'darkdustry.ml:0000',
    description:
      'Проектируйте свои схемы на специальной карте, где нет врагов, но есть бесконечные источники ресурсов',
    image: Mindustry,
  },
  {
    mode: 'Hexed',
    ipPort: 'darkdustry.ml:0000',
    description:
      'Сражайтесь со множеством реальных игроков. Захватывайте новые сектора и уничтожайте базы других игроков. Для выигрыша захватите большинство секторов или уничтожьте всех игроков',
    image: Mindustry,
  },
  {
    mode: 'Pvp',
    ipPort: 'darkdustry.ml:0000',
    description:
      'Сражайтесь с реальными игроками. Быстро постройте свою базу, наладьте армию и уничтожитьте вашего соперника быстрее, чем он вас',
    image: Mindustry,
  },
  {
    mode: 'Tower Defence',
    ipPort: 'darkdustry.ml:0000',
    description:
      'Убивайте врагов, чтобы получить новые ресурсы. Улучшайте оборону вдоль дороги, по которой бесконечно идут всё более сильные враги, чтобы оборонять вашу базу, как можно дольше',
    image: Mindustry,
  },
  {
    mode: 'Crawler Arena',
    ipPort: 'darkdustry.ml:0000',
    description:
      'Защищайте вашу базу от наступающих на вас всё более сильных волн ползунов с ограниченными ресурсами и обороной. Зарабатываете деньги за прохождение волн, чтобы улучшить своего юнита и улучшить оборону',
    image: Mindustry,
  },
  {
    mode: 'Hex Industry',
    ipPort: 'darkdustry.ml:0000',
    description:
      'Сражайтесь со множеством реальных игроков. Захватывайте новые сектора и уничтожайте базы других игроков. Для выигрыша захватите большинство секторов или уничтожьте всех игроков',
    image: Mindustry,
  }
];
